docker/deployment-init/files/create-web-portal-app.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:xsd="http://org.apache.axis2/xsd" xmlns:xsd1="http://model.common.application.identity.carbon.wso2.org/xsd" xmlns:xsd2="http://script.model.common.application.identity.carbon.wso2.org/xsd">
    <soap:Header/>
    <soap:Body>
        <xsd:createApplication>
            <xsd:serviceProvider>
                <xsd1:applicationName>CelleryWebPortal</xsd1:applicationName>
            </xsd:serviceProvider>
        </xsd:createApplication>
    </soap:Body>
</soap:Envelope>